import { Injectable } from '@angular/core';
import { Img } from 'src/app/shared/interfaces/img.interface';

@Injectable({
  providedIn: 'root'
})
export class MainConfigService {

  getLogo(): Img {
    return {
      src: 'assets/imgs/logo.svg',
        alt: 'landerX',
    }
  }
  getPageConfig(): any {
    return {
      navbar: {
        logoImg: {
          src: 'assets/imgs/logo.svg',
          alt: 'landerX',
        },
        cta: {
          text: 'התחילו עכשיו!',
          size: 'small',
          color: 'primery',
        },
      },
      header: {
        img: {
          src: 'assets/imgs/header-img.webp',
          alt: 'WOW',
        },
        cta: {
          text: 'התחילו עכשיו!',
          size: 'big',
          color: 'primery',
        },
        title: 'כי כל קמפיין צריך נחיתה טובה',
        paragraph: 'ניהול קמפיינים ועמודי נחיתה בצורה חכמה ויעילה, אינטגרציה חלקה עם גוגל אדס ועמודי נחיתה מתבנית או מותאמים אישית עם מתכנת.'
      },
      about: {
        title: 'מי אנחנו?',
        subtitle: 'קצת עלינו',
        paragraph: [
          'אנחנו חברה צעירה ודינמית שמתמחה בבניית עמודי נחיתה מהירים ומעוצבים, ובניהול קמפיינים ממומנים בגוגל.',
          'המשימה שלנו היא להפוך את הקמפיינים שלכם למוצלחים ויעילים ככל האפשר. אנחנו מאמינים בשילוב של טכנולוגיה, AI, עיצוב ושיווק דיגיטלי כדי להביא לכם את התוצאות הטובות ביותר.',
          'אנחנו גאים במחירים התחרותיים שלנו, ומחויבים להציע לכם שירות מקצועי ואישי. אצלנו, אתם לא רק לקוחות - אתם שותפים.'
        ]
      },
      ourServices: {
        title: 'מה אנחנו עושים?',
        subtitle: 'השירותים שלנו',
        cards: [
          {
            img: {
              src: 'assets/imgs/services-lp.webp',
              alt: 'בניית עמודי נחיתה מעוצבים',
            },
            title: 'בניית עמודי נחיתה מעוצבים',
            paragraph: 'מותאמים אישים עם מתכנת בטכנולוגיה הכי מתקדמת, ושימוש ב-AI. מחוברים ישירות למערכת גוגל אדס ומיועדים להגברת המרות.'
          },
          {
            img: {
              src: 'assets/imgs/services-ad.webp',
              alt: 'ניהול קמפיינים ממומנים בגוגל',
            },
            title: 'ניהול קמפיינים ממומנים בגוגל',
            paragraph: 'אנו מנהלים את הקמפיינים שלכם בגוגל באופן מקצועי, כדי להבטיח שאתם מקבלים את התמורה הטובה ביותר להשקעה שלכם.'
          },
          {
            img: {
              src: 'assets/imgs/services-lids.webp',
              alt: 'ייצור לידים',
            },
            title: 'ייצור לידים',
            paragraph: 'השילוב של טכנולוגיה מתקדמת, AI ואינטגרציה חלקה עם גוגל אדס מאפשר לנו לייצר לכם לידים איכותיים בצורה אוטומטית ויעילה.'
          },
          {
            img: {
              src: 'assets/imgs/services-prices.webp',
              alt: 'מחירים תחרותיים',
            },
            title: 'מחירים תחרותיים',
            paragraph: 'אנו מציעים שירותים מקצועיים במחירים תחרותיים, כדי להבטיח שאתם מקבלים את הערך הטוב ביותר לכסף שלכם.'
          },
          {
            img: {
              src: 'assets/imgs/services-self.webp',
              alt: 'התאמה אישית וגמישות',
            },
            title: 'התאמה אישית וגמישות',
            paragraph: 'אנו מבינים שכל שירות או מוצר הוא ייחודי, ולכן אנו מציעים פתרונות מותאמים אישית שמתחשבים בצרכים ובתקציב שלכם. הגמישות שלנו מאפשרת לנו להתאים את השירותים שלנו בדיוק למה שאתם זקוקים לו, ולהבטיח שאתם מרוצים מהתוצאות.'
          },
          {
            img: {
              src: 'assets/imgs/services-settings.webp',
              alt: 'אחזקה ותמיכה טכנית',
            },
            title: 'אחזקה ותמיכה טכנית',
            paragraph: 'אנו מספקים ללקוחותינו מערך אחזקה שמבטיחה "ראש שקט", ותמיכה טכנית מבוססת מאגר ידע גדול. המקצוענות שלנו וההתמקדות בפרטים מבטיחים שהתהליכים הטכניים המורכבים נעשים בקלות וביעילות, ואתם יכולים להתמקד במה שחשוב לכם.'
          }
        ]
      },
      whyUs: {
        title: 'אז למה לבחור בנו?',
        img: {
          src: 'assets/imgs/why-us-img.webp',
          alt: 'אז למה לבחור בנו?',
        },
        bullets: [
          {
            title: 'מומחיות מקצועית',
            text: 'אנו מתמחים בבניית עמודי נחיתה מהירים ומעוצבים, ובניהול קמפיינים ממומנים בגוגל, כדי להבטיח שאתם מקבלים את התוצאות הטובות ביותר.'
          },
          {
            title: 'תוצאות מדידות',
            text: 'אנו מתמקדים במדדים ובנתונים, כדי להבטיח שאתם מקבלים תוצאות ממשיות ומדויקות. אנו מעקבים אחרי ההצלחה של הקמפיינים שלכם ומספקים לכם דוחות מפורטים.'
          },
          {
            title: 'מחירים תחרותיים',
            text: 'אנו מציעים שירותים מקצועיים במחירים תחרותיים, כדי להבטיח שאתם מקבלים את הערך הטוב ביותר לכסף שלכם..'
          }
        ]
      },
      faq: {
        title: 'יש לכם שאלה?',
        subtitle: 'שאלות ותשובות',
        qs: [
          {
            title: 'איך בונים עמוד נחיתה שיהיה יעיל?',
            answer: 'תשובה: על עמוד הנחיתה לכלול עיצוב נקי ומקצועי, קריאה חזקה לפעולה, תוכן רלוונטי ואופטימיזציה למנועי חיפוש.'
          },
          {
            title: 'איך ממודדים את הצלחת הקמפיין שלי?',
            answer: 'תשובה: השתמשו בכלים כמו Google Analytics למדידת תעבורה, קליקים, קצב המרה ו-ROI, ועקבו אחר המדדים באופן תדיר.'
          },
          {
            title: 'איך מקבלים תעבורה איכותית לעמוד הנחיתה שלי?',
            answer: 'תשובה: שלב שיטות שיווק דיגיטלי כמו פרסום ממומן ושיווק תוכן כדי למשוך קהל מכוון.'
          },
          {
            title: 'איך מבטיחים שהעמוד הנחיתה מתאים למכשירים ניידים?',
            answer: 'תשובה: השתמשו בעיצוב רספונסיבי שמתאים את עצמו לכל סוגי המכשירים ובדקו את העמוד במכשירים שונים לוודא שהוא נראה טוב.'
          },  {
            title: 'איך יכולים לייעל את ההוצאות על קמפיינים ממומנים?',
            answer: 'תשובה: ניהול תקציב מדוד וממוקד, שימוש במילות מפתח רלוונטיות ובדיקות תדירות של הביצועים יכולים להביא לייעול ההוצאות.'
          },
          {
            title: 'מה זה עמוד נחיתה ולמה אני צריך את זה?',
            answer: 'string'
          }
        ]
      },
      footer: {
        contact: {
          title: 'מעוניינים?',
          subtitle: 'השאירו פרטים',
          form: {
            name: {
              text: 'מה שמך?',
              lable: 'שם',
              error: 'מלאו את השם בבקשה'
            },
            email: {
              text: 'מה כתובת המייל שלך?',
              lable: 'אימייל',
              error: 'מלאו את כתובת האימייל בבקשה'
            },
            phone: {
              text: 'מה הטלפון שלך?',
              lable: 'טלפון',
              error: 'מלאו את הטלפון בבקשה'
            },
            submit: 'צרו איתי קשר!',
          },
          message: {
            title: "תודה על פניתך",
            subtitle: "ההודעה שלך התקבלה בהצלחה! ניהיה בקשר:)"
          },
          logo: {
            src: 'assets/imgs/logo.svg',
            alt: 'landerX',
          }
        },
        logoImg: {
          src: 'assets/imgs/logo.svg',
          alt: 'landerX',
        },
        copyright:
          '©2023 LanderX. All rights reserved. The content on this landing page, including text, images, videos, and design, is protected by copyright and may not be used without the express permission of LanderX.',
      },
    }
  }
}
